physics/fluid-mechanics/annotated-bibliography.org
#+TITLE: Annotated Bibliography
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2021-05-31T10:00:48-07:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
# Created Monday May 31, 2021 at 10:00AM

See also Fairbairn and Macdonald's [[https://www.math.ubc.ca/~cbm/projects/fluids_biblio/fluids_biblio.html][Bibliography of Fluid Dynamics Books]],
which lists a number of useful books within several domains of fluids.

* Intermediate linear algebra
:PROPERTIES:
:CUSTOM_ID: h-0ca4682d-9f77-433c-9f71-f1361e535886
:END:

Linear algebra in infinite dimensions is basically functional analysis,
which underlies a lot of partial differential equation machinery. So you
need to be very comfortable with linear algebra.

- Axler's {{{book-title(Linear algebra done right)}}}
- Strang's book on linear algebra
* Partial differential equations
:PROPERTIES:
:CUSTOM_ID: h-6fee042b-d6c0-4a15-9fbf-9191b160012d
:END:

Fluids are famously nonlinear PDEs. So we'll need to get very
comfortable with PDEs.

- Walter Strauss,\\
  {{{book-title(Partial Differential Equations: An Introduction)}}}.\\
  This is the book where I learned the basics of first-order PDEs, and the "big three"
  second-order PDEs (the heat equation, wave equation, Poisson's equation)
- Lawrence Evans,\\
  {{{book-title(Partial Differential Equations)}}}.\\
  This has become /the/ textbook for graduate level PDEs.
- (I don't know where to put this, but Atkinson and Han's
  {{{book-title(Theoretical Numerical Analysis: A Functional Analysis Framework)}}}
  discusses functional analysis and numerical differential equations
  in a unique way; it may be useful for people who want to learn
  functional analysis in an "applied" manner.)
* Numerical Analysis
:PROPERTIES:
:CUSTOM_ID: h-04388f5f-fb6e-4b5b-89dd-bd0b76fb19f3
:END:
** Basic Numerical Analysis
:PROPERTIES:
:CUSTOM_ID: h-8cd33e76-df0f-4711-96b7-079e9856762d
:END:

Learning floating-point arithmetic, root finding algorithms, polynomial interpolation, quadrature)

- Burden and Faires' {{{book-title(Numerical Analysis)}}} is the
  standard introductory text
- Timothy Sauer's {{{book-title(Numerical Analysis)}}} was the
  text I learned from, it's decent but not rigorous enough for my tastes.
- Trefethen and Bau's Numerical Linear Algebra book does a great
  job discussing floating point in chapter 13

** Numerical Linear Algebra
:PROPERTIES:
:CUSTOM_ID: h-a8bb56ef-6f42-4fd3-8b1f-5d974a9531aa
:END:

- Lloyd N. Trefethen, David Bau III,\\
  {{{book-title(Numerical Linear Algebra)}}}.\\
  Trefethen is a giant in numerical analysis, and the tone of this
  book is gentle and approachable.
- James Demmel,\\
  {{{book-title(Applied Numerical Linear Algebra)}}}.\\
  This complements Trefethen and Bau, a similar tone, and if
  possible should be checked out from the library.
- Golub's {{{book-title(Matrix Computations)}}} has been
  recommended, but it's an encyclopedia of results rather than an
  introduction to the field. I wouldn't recommend this as an
  introduction, but if you're serious about numerical linear
  algebra, then this is as necessary as a dictionary to a writer.

** Numerical Differential Equations
:PROPERTIES:
:CUSTOM_ID: h-0ae24c9b-81d7-4117-9d89-d3cae353886e
:END:

This is trickier, because there are three basic toolkits to solve differential equations
numerically (finite difference schemes, finite element method, and
finite volume method)

*** Finite Difference Method
:PROPERTIES:
:CUSTOM_ID: h-5f57c166-ec6b-44e7-b55f-b1e9a2e57013
:END:

The "immediately obvious" method to numerically solve a differential
equation is to replace the differential operator with finite differences.

- R. LeVeque,\\
  {{{book-title(Finite Difference Methods for Ordinary and Partial Differential Equations: Steady State and Time Dependent Problems)}}}.\\
  LeVeque writes beautifully, so I recommend whatever he writes;
  however, if you have the ability to check this out from the
  library, then check out the library's copy.
- JW Thomas,\\
  {{{book-title(Numerical Partial Differential Equations: Finite Differences)}}}.\\
  Springer. Thomas' book is an amazing experience, I heartily
  recommend it.
  - The sequel to this, {{{book-title(Numerical Partial Differential Equations: Conservation Laws and Elliptic Equations)}}},
    I have yet to read, but I am excited to begin it soon.

*** Finite Volume Method
:PROPERTIES:
:CUSTOM_ID: h-f32b60e6-dc2f-4273-b52a-33631029b311
:END:

Since continuity equations are usually in integral form, we can use a
mesh to discretize the domain of integration, use the divergence theorem
(or Stokes' theorem, or whatever) and sufficiently fine meshes to
transform the continuity equations into sums of integrals of
approximately piecewise-linear functions. This is the finite volume
method (in a nutshell), and LeVeque writes beautifully about it.

- R. LeVeque,\\
  {{{book-title(Finite Volume Methods for Hyperbolic Problems)}}}.\\
  This specifically has fluids in mind, and discusses the algorithms
  used by LeVeque's CLAWPACK library.

