docs/physics/fluid-mechanics/annotated-bibliography.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Annotated Bibliography</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Annotated Bibliography</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-0ca4682d-9f77-433c-9f71-f1361e535886">1. Intermediate linear algebra</a></li>
<li><a href="#h-6fee042b-d6c0-4a15-9fbf-9191b160012d">2. Partial differential equations</a></li>
<li><a href="#h-04388f5f-fb6e-4b5b-89dd-bd0b76fb19f3">3. Numerical Analysis</a>
<ul>
<li><a href="#h-8cd33e76-df0f-4711-96b7-079e9856762d">3.1. Basic Numerical Analysis</a></li>
<li><a href="#h-a8bb56ef-6f42-4fd3-8b1f-5d974a9531aa">3.2. Numerical Linear Algebra</a></li>
<li><a href="#h-0ae24c9b-81d7-4117-9d89-d3cae353886e">3.3. Numerical Differential Equations</a>
<ul>
<li><a href="#h-5f57c166-ec6b-44e7-b55f-b1e9a2e57013">3.3.1. Finite Difference Method</a></li>
<li><a href="#h-f32b60e6-dc2f-4273-b52a-33631029b311">3.3.2. Finite Volume Method</a></li>
<li><a href="#h-538e1ab5-fe19-4aec-80a5-da1b444c4c41">3.3.3. Finite Element Method</a></li>
<li><a href="#h-22bb7fa2-f402-4b16-b36b-860ba9496967">3.3.4. Spectral Methods</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-79eebd81-d355-4a58-b827-c2dab6f8f762">4. Basic Fluids</a></li>
<li><a href="#h-d29dcbeb-f755-41c1-8bb0-77f7e115dfd4">5. Numerical Methods for Fluids</a></li>
<li><a href="#h-ee42a495-78bb-4ac1-9544-bee33e6f197a">6. Navier&#x2013;Stokes Equations</a></li>
<li><a href="#h-0697d22a-8246-4e68-a12f-cb3a5a502eb6">7. Syllabi</a></li>
</ul>
</div>
</div>
<p>
See also Fairbairn and Macdonald's <a href="https://www.math.ubc.ca/~cbm/projects/fluids_biblio/fluids_biblio.html">Bibliography of Fluid Dynamics Books</a>,
which lists a number of useful books within several domains of fluids.
</p>
<div id="outline-container-h-0ca4682d-9f77-433c-9f71-f1361e535886" class="outline-2">
<h2 id="h-0ca4682d-9f77-433c-9f71-f1361e535886"><span class="section-number-2">1.</span> Intermediate linear algebra</h2>
<div class="outline-text-2" id="text-h-0ca4682d-9f77-433c-9f71-f1361e535886">
<p>
Linear algebra in infinite dimensions is basically functional analysis,
which underlies a lot of partial differential equation machinery. So you
need to be very comfortable with linear algebra.
</p>

<ul class="org-ul">
<li>Axler's <cite class="book-title">Linear algebra done right</cite></li>
<li>Strang's book on linear algebra</li>
</ul>
</div>
</div>
<div id="outline-container-h-6fee042b-d6c0-4a15-9fbf-9191b160012d" class="outline-2">
<h2 id="h-6fee042b-d6c0-4a15-9fbf-9191b160012d"><span class="section-number-2">2.</span> Partial differential equations</h2>
<div class="outline-text-2" id="text-h-6fee042b-d6c0-4a15-9fbf-9191b160012d">
<p>
Fluids are famously nonlinear PDEs. So we'll need to get very
comfortable with PDEs.
</p>

<ul class="org-ul">
<li>Walter Strauss,<br>
<cite class="book-title">Partial Differential Equations: An Introduction</cite>.<br>
This is the book where I learned the basics of first-order PDEs, and the "big three"
second-order PDEs (the heat equation, wave equation, Poisson's equation)</li>
<li>Peter J. Olver,<br>
<cite class="book-title">Introduction to Partial Differential Equations</cite>.<br>
Springer, 2013.
A great alternative to Strauss for people more concerned about
rigor. Also Olver has great explanations.</li>
<li>Lawrence Evans,<br>
<cite class="book-title">Partial Differential Equations</cite>.<br>
This has become <i>the</i> textbook for graduate level PDEs.</li>
<li>(I don't know where to put this, but Atkinson and Han's
<cite class="book-title">Theoretical Numerical Analysis: A Functional Analysis Framework</cite>
discusses functional analysis and numerical differential equations
in a unique way; it may be useful for people who want to learn
functional analysis in an "applied" manner.)</li>
</ul>
</div>
</div>
<div id="outline-container-h-04388f5f-fb6e-4b5b-89dd-bd0b76fb19f3" class="outline-2">
<h2 id="h-04388f5f-fb6e-4b5b-89dd-bd0b76fb19f3"><span class="section-number-2">3.</span> Numerical Analysis</h2>
<div class="outline-text-2" id="text-h-04388f5f-fb6e-4b5b-89dd-bd0b76fb19f3">
</div>
<div id="outline-container-h-8cd33e76-df0f-4711-96b7-079e9856762d" class="outline-3">
<h3 id="h-8cd33e76-df0f-4711-96b7-079e9856762d"><span class="section-number-3">3.1.</span> Basic Numerical Analysis</h3>
<div class="outline-text-3" id="text-h-8cd33e76-df0f-4711-96b7-079e9856762d">
<p>
Learning floating-point arithmetic, root finding algorithms, polynomial interpolation, quadrature)
</p>

<ul class="org-ul">
<li>Burden and Faires' <cite class="book-title">Numerical Analysis</cite> is the
standard introductory text</li>
<li>Timothy Sauer's <cite class="book-title">Numerical Analysis</cite> was the
text I learned from, it's decent but not rigorous enough for my tastes.</li>
<li>Trefethen and Bau's <cite class="book-title">Numerical Linear Algebra</cite> book does a great
job discussing floating point in chapter 13</li>
</ul>
</div>
</div>
<div id="outline-container-h-a8bb56ef-6f42-4fd3-8b1f-5d974a9531aa" class="outline-3">
<h3 id="h-a8bb56ef-6f42-4fd3-8b1f-5d974a9531aa"><span class="section-number-3">3.2.</span> Numerical Linear Algebra</h3>
<div class="outline-text-3" id="text-h-a8bb56ef-6f42-4fd3-8b1f-5d974a9531aa">
<ul class="org-ul">
<li>Lloyd N. Trefethen, David Bau III,<br>
<cite class="book-title">Numerical Linear Algebra</cite>.<br>
Trefethen is a giant in numerical analysis, and the tone of this
book is gentle and approachable.</li>
<li>James Demmel,<br>
<cite class="book-title">Applied Numerical Linear Algebra</cite>.<br>
This complements Trefethen and Bau, a similar tone, and if
possible should be checked out from the library.</li>
<li>Golub's <cite class="book-title">Matrix Computations</cite> has been
recommended, but it's an encyclopedia of results rather than an
introduction to the field. I wouldn't recommend this as an
introduction, but if you're serious about numerical linear
algebra, then this is as necessary as a dictionary to a writer.</li>
</ul>
</div>
</div>
<div id="outline-container-h-0ae24c9b-81d7-4117-9d89-d3cae353886e" class="outline-3">
<h3 id="h-0ae24c9b-81d7-4117-9d89-d3cae353886e"><span class="section-number-3">3.3.</span> Numerical Differential Equations</h3>
<div class="outline-text-3" id="text-h-0ae24c9b-81d7-4117-9d89-d3cae353886e">
<p>
This is trickier, because there are three basic toolkits to solve differential equations
numerically (finite difference schemes, finite element method, and
finite volume method)
</p>
</div>
<div id="outline-container-h-5f57c166-ec6b-44e7-b55f-b1e9a2e57013" class="outline-4">
<h4 id="h-5f57c166-ec6b-44e7-b55f-b1e9a2e57013"><span class="section-number-4">3.3.1.</span> Finite Difference Method</h4>
<div class="outline-text-4" id="text-h-5f57c166-ec6b-44e7-b55f-b1e9a2e57013">
<p>
The "immediately obvious" method to numerically solve a differential
equation is to replace the differential operator with finite differences.
</p>

<ul class="org-ul">
<li>R. LeVeque,<br>
<cite class="book-title">Finite Difference Methods for Ordinary and Partial Differential Equations: Steady State and Time Dependent Problems</cite>.<br>
LeVeque writes beautifully, so I recommend whatever he writes;
however, if you have the ability to check this out from the
library, then check out the library's copy.</li>
<li>JW Thomas,<br>
<cite class="book-title">Numerical Partial Differential Equations: Finite Differences</cite>.<br>
Springer. Thomas' book is an amazing experience, I heartily
recommend it.
<ul class="org-ul">
<li>The sequel to this, <cite class="book-title">Numerical Partial Differential Equations: Conservation Laws and Elliptic Equations</cite>,
I have yet to read, but I am excited to begin it soon.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-h-f32b60e6-dc2f-4273-b52a-33631029b311" class="outline-4">
<h4 id="h-f32b60e6-dc2f-4273-b52a-33631029b311"><span class="section-number-4">3.3.2.</span> Finite Volume Method</h4>
<div class="outline-text-4" id="text-h-f32b60e6-dc2f-4273-b52a-33631029b311">
<p>
Since continuity equations are usually in integral form, we can use a
mesh to discretize the domain of integration, use the divergence theorem
(or Stokes' theorem, or whatever) and sufficiently fine meshes to
transform the continuity equations into sums of integrals of
approximately piecewise-linear functions. This is the finite volume
method (in a nutshell), and LeVeque writes beautifully about it.
</p>

<ul class="org-ul">
<li>R. LeVeque,<br>
<cite class="book-title">Finite Volume Methods for Hyperbolic Problems</cite>.<br>
This specifically has fluids in mind, and discusses the algorithms
used by LeVeque's CLAWPACK library.</li>
</ul>
</div>
</div>
