physics/fluid-mechanics/annotated-bibliography.org
*** Finite Element Method
:PROPERTIES:
:CUSTOM_ID: h-538e1ab5-fe19-4aec-80a5-da1b444c4c41
:END:

I'm still looking for /good/ references on finite element method.
Currently I refer to Hughes, which is a very readable and enjoyable book.
Basically, the finite element method discretizes the function space of
solutions and test functions using locally smooth functions (usually
piecewise linear functions like the "hat function", or some low order
polynomial defined on some local domain).

- Thomas J.R. Hughes,\\
  {{{book-title(The Finite Element Method: Linear Static and Dynamic Finite Element Analysis)}}}.\\
  Published by Dover, it's the best (and only) book I've seen on finite
  element analysis. Basically, we transform a PDE into its weak form,
  which requires integrating against arbitrary test functions. The
  finite element method discretizes the space of test functions, which
  transforms the problem to one of linear algebra.

*** Spectral Methods
:PROPERTIES:
:CUSTOM_ID: h-22bb7fa2-f402-4b16-b36b-860ba9496967
:END:

I have no good reference for this, but basically this discretizes the
function space as a truncated Fourier series. More generally, instead of
using $\exp(\I nx)$ as the basis functions, we could use a different
choice of basis. We could view this as a generalization of the finite
element method, I think; the difference being the basis functions used
in finite element method are *local* smooth functions (like the bump
function), whereas the spectral method uses *global* smooth functions
(like $\E^{\I nx}$).

Here are some references which have been /recommended to me/ but I have not followed up reading yet...

- John P. Boyd,\\
  {{{book-title(Chebyshev and Fourier Spectral Methods)}}}.\\
  This is one of the only references I know for the spectral method,
  which basically uses a truncated Fourier series with unknown
  coefficients. For sufficiently smooth solutions, we only need a few
  coefficients to get a good approximation, which tends to work
  remarkably well with climate models. It also helps this book has been
  republished by Dover, so it's on the cheap side, and it's available on
  the [[http://www-personal.umich.edu/~jpboyd/BOOK_Spectral2000.html][author's website]].
- C. Canuto, M.Y. Hussaini, A. Quarteroni, and T.A. Zang,\\
  {{{book-title(Spectral Methods in Fluid Dynamics)}}}.\\
  Springer Verlag, Berlin, Germany; Heidelberg, Germany, 1988.
- C. Canuto, M.Y. Hussaini, A. Quarteroni, and T.A. Zang,\\
  {{{book-title(Spectral Methods: Fundamentals in Single Domains)}}}.\\
  Springer Verlag, Berlin, Germany; Heidelberg, Germany, 2006).
- C. Canuto, M.Y. Hussaini, A. Quarteroni, and T.A. Zang,\\
  {{{book-title(Spectral Methods: Evolution to Complex Geometries and Applications to Fluid Dynamics)}}}.\\
  Springer Verlag, Berlin, Germany;Heidelberg, Germany, 2007.
- B. Fornberg,\\
  {{{book-title(Practical Guide to Pseudospectral Methods)}}}.\\
  Cambridge University Press, Cambridge, U.K., 1995.
- D. Gottlieb and S.A. Orszag,\\
  {{{book-title(Numerical Analysis of Spectral Methods: Theory and Applications)}}}.\\
  Society for Industrial and Applied Mathematics, Philadelphia, U.S.A., 1977.
- J.S. Hesthaven, S. Gottlieb, and D. Gottlieb,\\
  {{{book-title(Spectral Methods for Time-Dependent Problems)}}}.\\
  Cambridge University Press, Cambridge, U.K., 2007.


* Basic Fluids
:PROPERTIES:
:CUSTOM_ID: h-79eebd81-d355-4a58-b827-c2dab6f8f762
:END:

- George Batchelor's {{{book-title(An Introduction to Fluid Dynamics)}}}
  is the classic introduction to the field; the first few chapters
  are required reading for everyone
  - Simon J.A. Malham's [[http://www.macs.hw.ac.uk/~simonm/lms-epsrc_short_course_2011/fluidsnotes.pdf][Introductory fluid mechanics]] (pdf) is based
    on Batchelor's book, just as Batchelor's book was based on Lamb's
    {{{book-title(Hydrodynamics)}}}
- Stephen Childress,\\
  "An Introduction to Theoretical Fluid Dynamics".\\
  Lecture notes, [[https://www.math.nyu.edu/~childres/fluidsbook.pdf][pdf]], 177 pages. This was polished then published as
  a book, I think it's wonderful.
- Landau and Lifshitz,\\
  {{{book-title(Fluid Mechanics)}}}, 2nd ed.\\
  This is a "classic", but assumes the reader knows thermodynamics,
  and is presented in a "reverse mathematical style" (instead of
  "definition--theorem--proof", they do "definition--proof--theorem"
  without any clear delineations). I admit I have not seen as elegant
  a derivation of consequences from Euler's flow equations.
- Alexandre Chorin, Jerrold Marsden,\\
  {{{book-title(A Mathematical Introduction to Fluid Mechanics)}}}.\\
  Third ed., Springer, 1993. This is probably the introduction most
  "pure mathematicians" prefer (your mileage may vary).
- Frank White,\\
  {{{book-title(Fluid Mechanics)}}}.\\
  Written with hydrodynamics in mind, it's a friendly introductory
  physics text.
- Pijush K. Kundu and Ira M. Cohen,\\
  {{{book-title(Fluid Mechanics)}}}.\\
  A standard introductory text, used by MIT.
- D. J. Tritton,\\
  {{{book-title(Physical fluid dynamics)}}}.\\
  An experimentally grounded text, written for physicists, but I'm
  including it to note (if mathematicians want to learn the empirical
  side of fluids) this is the resource for experiments.
- M. Van Dyke,\\
  {{{book-title(Album of Fluid Motion)}}}.\\
  Referenced by several syllabi, it's a picture book of various flows.

* Numerical Methods for Fluids
:PROPERTIES:
:CUSTOM_ID: h-d29dcbeb-f755-41c1-8bb0-77f7e115dfd4
:END:

- R. LeVeque,\\
  {{{book-title(Numerical Methods for Conservation Laws)}}}.\\
  A slim but beautiful book.
- Roger Temam,\\
  {{{book-title(Navier-Stokes equations, Theory and numerical analysis)}}}.\\
  This book beautifully works through the numerical analysis (as of
  the mid 1980s) of the steady state Navier--Stokes, first the
  linearized version and then the full nonlinear stead-state, and
  then gives some discussion to the full problem.\\
  If interested, the reader may consult Galdi's 2-volume
  {{{book-title(An introduction to the mathematical theory of the Navier-Stokes equations, Steady-state problems)}}}.

* Navier--Stokes Equations
:PROPERTIES:
:CUSTOM_ID: h-ee42a495-78bb-4ac1-9544-bee33e6f197a
:END:

- Pierre Gilles Lemarie-Rieusset,\\
  {{{book-title(The Navier-Stokes problem in the 21st century)}}}.\\
  This is an amazingly thorough yet gentle introduction to the subject.
  It's written with the Clay millennium prize in mind.
- Tai-Peng Tsai,\\
  {{{book-title(Lectures on Navier-Stokes equations)}}}.\\
  AMS Graduate studies series. A good book after reading the first
  few chapters of Evans' _PDEs_, Tsai reviews the various aspects to
  Navier-Stokes in a very gentle manner. Also good is the citations
  to the literature (done immediately on page ix, literally the
  second sentence). The focus of this book is theory of the
  existence, uniqueness, and regularity of solutions to Navier-Stokes.
-




