docs/physics/fluid-mechanics/annotated-bibliography.html
<div id="outline-container-h-538e1ab5-fe19-4aec-80a5-da1b444c4c41" class="outline-4">
<h4 id="h-538e1ab5-fe19-4aec-80a5-da1b444c4c41"><span class="section-number-4">3.3.3.</span> Finite Element Method</h4>
<div class="outline-text-4" id="text-h-538e1ab5-fe19-4aec-80a5-da1b444c4c41">
<p>
I'm still looking for <i>good</i> references on finite element method.
Currently I refer to Hughes, which is a very readable and enjoyable book.
Basically, the finite element method discretizes the function space of
solutions and test functions using locally smooth functions (usually
piecewise linear functions like the "hat function", or some low order
polynomial defined on some local domain).
</p>

<ul class="org-ul">
<li>Thomas J.R. Hughes,<br>
<cite class="book-title">The Finite Element Method: Linear Static and Dynamic Finite Element Analysis</cite>.<br>
Published by Dover, it's the best (and only) book I've seen on finite
element analysis. Basically, we transform a PDE into its weak form,
which requires integrating against arbitrary test functions. The
finite element method discretizes the space of test functions, which
transforms the problem to one of linear algebra.</li>
</ul>
</div>
</div>
<div id="outline-container-h-22bb7fa2-f402-4b16-b36b-860ba9496967" class="outline-4">
<h4 id="h-22bb7fa2-f402-4b16-b36b-860ba9496967"><span class="section-number-4">3.3.4.</span> Spectral Methods</h4>
<div class="outline-text-4" id="text-h-22bb7fa2-f402-4b16-b36b-860ba9496967">
<p>
I have no good reference for this, but basically this discretizes the
function space as a truncated Fourier series. More generally, instead of
using \(\exp(\I nx)\) as the basis functions, we could use a different
choice of basis. We could view this as a generalization of the finite
element method, I think; the difference being the basis functions used
in finite element method are <b>local</b> smooth functions (like the bump
function), whereas the spectral method uses <b>global</b> smooth functions
(like \(\E^{\I nx}\)).
</p>

<p>
Here are some references which have been <i>recommended to me</i> but I have not followed up reading yet&#x2026;
</p>

<ul class="org-ul">
<li>John P. Boyd,<br>
<cite class="book-title">Chebyshev and Fourier Spectral Methods</cite>.<br>
This is one of the only references I know for the spectral method,
which basically uses a truncated Fourier series with unknown
coefficients. For sufficiently smooth solutions, we only need a few
coefficients to get a good approximation, which tends to work
remarkably well with climate models. It also helps this book has been
republished by Dover, so it's on the cheap side, and it's available on
the <a href="http://www-personal.umich.edu/~jpboyd/BOOK_Spectral2000.html">author's website</a>.</li>
<li>C. Canuto, M.Y. Hussaini, A. Quarteroni, and T.A. Zang,<br>
<cite class="book-title">Spectral Methods in Fluid Dynamics</cite>.<br>
Springer Verlag, Berlin, Germany; Heidelberg, Germany, 1988.</li>
<li>C. Canuto, M.Y. Hussaini, A. Quarteroni, and T.A. Zang,<br>
<cite class="book-title">Spectral Methods: Fundamentals in Single Domains</cite>.<br>
Springer Verlag, Berlin, Germany; Heidelberg, Germany, 2006).</li>
<li>C. Canuto, M.Y. Hussaini, A. Quarteroni, and T.A. Zang,<br>
<cite class="book-title">Spectral Methods: Evolution to Complex Geometries and Applications to Fluid Dynamics</cite>.<br>
Springer Verlag, Berlin, Germany;Heidelberg, Germany, 2007.</li>
<li>B. Fornberg,<br>
<cite class="book-title">Practical Guide to Pseudospectral Methods</cite>.<br>
Cambridge University Press, Cambridge, U.K., 1995.</li>
<li>D. Gottlieb and S.A. Orszag,<br>
<cite class="book-title">Numerical Analysis of Spectral Methods: Theory and Applications</cite>.<br>
Society for Industrial and Applied Mathematics, Philadelphia, U.S.A., 1977.</li>
<li>J.S. Hesthaven, S. Gottlieb, and D. Gottlieb,<br>
<cite class="book-title">Spectral Methods for Time-Dependent Problems</cite>.<br>
Cambridge University Press, Cambridge, U.K., 2007.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-h-79eebd81-d355-4a58-b827-c2dab6f8f762" class="outline-2">
<h2 id="h-79eebd81-d355-4a58-b827-c2dab6f8f762"><span class="section-number-2">4.</span> Basic Fluids</h2>
<div class="outline-text-2" id="text-h-79eebd81-d355-4a58-b827-c2dab6f8f762">
<ul class="org-ul">
<li>George Batchelor's <cite class="book-title">An Introduction to Fluid Dynamics</cite>
is the classic introduction to the field; the first few chapters
are required reading for everyone
<ul class="org-ul">
<li>Simon J.A. Malham's <a href="http://www.macs.hw.ac.uk/~simonm/lms-epsrc_short_course_2011/fluidsnotes.pdf">Introductory fluid mechanics</a> (pdf) is based
on Batchelor's book, just as Batchelor's book was based on Lamb's
<cite class="book-title">Hydrodynamics</cite></li>
</ul></li>
<li>Stephen Childress,<br>
"An Introduction to Theoretical Fluid Dynamics".<br>
Lecture notes, <a href="https://www.math.nyu.edu/~childres/fluidsbook.pdf">pdf</a>, 177 pages. This was polished then published as
a book, I think it's wonderful.</li>
<li>Landau and Lifshitz,<br>
<cite class="book-title">Fluid Mechanics</cite>, 2nd ed.<br>
This is a "classic", but assumes the reader knows thermodynamics,
and is presented in a "reverse mathematical style" (instead of
"definition&#x2013;theorem&#x2013;proof", they do "definition&#x2013;proof&#x2013;theorem"
without any clear delineations). I admit I have not seen as elegant
a derivation of consequences from Euler's flow equations.</li>
<li>Alexandre Chorin, Jerrold Marsden,<br>
<cite class="book-title">A Mathematical Introduction to Fluid Mechanics</cite>.<br>
Third ed., Springer, 1993. This is probably the introduction most
"pure mathematicians" prefer (your mileage may vary).</li>
<li>Frank White,<br>
<cite class="book-title">Fluid Mechanics</cite>.<br>
Written with hydrodynamics in mind, it's a friendly introductory
physics text.</li>
<li>Pijush K. Kundu and Ira M. Cohen,<br>
<cite class="book-title">Fluid Mechanics</cite>.<br>
A standard introductory text, used by MIT.</li>
<li>D. J. Tritton,<br>
<cite class="book-title">Physical fluid dynamics</cite>.<br>
An experimentally grounded text, written for physicists, but I'm
including it to note (if mathematicians want to learn the empirical
side of fluids) this is the resource for experiments.</li>
<li>M. Van Dyke,<br>
<cite class="book-title">Album of Fluid Motion</cite>.<br>
Referenced by several syllabi, it's a picture book of various flows.</li>
</ul>
</div>
</div>
<div id="outline-container-h-d29dcbeb-f755-41c1-8bb0-77f7e115dfd4" class="outline-2">
<h2 id="h-d29dcbeb-f755-41c1-8bb0-77f7e115dfd4"><span class="section-number-2">5.</span> Numerical Methods for Fluids</h2>
<div class="outline-text-2" id="text-h-d29dcbeb-f755-41c1-8bb0-77f7e115dfd4">
<ul class="org-ul">
<li>R. LeVeque,<br>
<cite class="book-title">Numerical Methods for Conservation Laws</cite>.<br>
A slim but beautiful book.</li>
<li>Roger Temam,<br>
<cite class="book-title">Navier-Stokes equations</cite>.<br>
This book beautifully works through the numerical analysis (as of
the mid 1980s) of the steady state Navier&#x2013;Stokes, first the
linearized version and then the full nonlinear stead-state, and
then gives some discussion to the full problem.<br>
If interested, the reader may consult Galdi's 2-volume
<cite class="book-title">An introduction to the mathematical theory of the Navier-Stokes equations</cite>.</li>
</ul>
</div>
</div>
<div id="outline-container-h-ee42a495-78bb-4ac1-9544-bee33e6f197a" class="outline-2">
<h2 id="h-ee42a495-78bb-4ac1-9544-bee33e6f197a"><span class="section-number-2">6.</span> Navier&#x2013;Stokes Equations</h2>
<div class="outline-text-2" id="text-h-ee42a495-78bb-4ac1-9544-bee33e6f197a">
<ul class="org-ul">
<li>Pierre Gilles Lemarie-Rieusset,<br>
<cite class="book-title">The Navier-Stokes problem in the 21st century</cite>.<br>
This is an amazingly thorough yet gentle introduction to the subject.
It's written with the Clay millennium prize in mind.</li>
<li>Tai-Peng Tsai,<br>
<cite class="book-title">Lectures on Navier-Stokes equations</cite>.<br>
AMS Graduate studies series. A good book after reading the first
few chapters of Evans' <span class="underline">PDEs</span>, Tsai reviews the various aspects to
Navier-Stokes in a very gentle manner. Also good is the citations
to the literature (done immediately on page ix, literally the
second sentence). The focus of this book is theory of the
existence, uniqueness, and regularity of solutions to Navier-Stokes.</li>
<li></li>
</ul>
</div>
</div>
