physics/fluid-mechanics/annotated-bibliography.org
* Syllabi
:PROPERTIES:
:CUSTOM_ID: h-0697d22a-8246-4e68-a12f-cb3a5a502eb6
:END:

Whenever learning a subject, it's wise to examine what the top
universities are doing when teaching the subject.

- MIT
  + 1.63 "Advanced Fluid Dynamics of the Environment" [[https://ocw.mit.edu/courses/civil-and-environmental-engineering/1-63-advanced-fluid-dynamics-of-the-environment-fall-2002/syllabus/][syllabus]]
  + 2.06 "Fluid Dynamics" [[https://ocw.mit.edu/courses/mechanical-engineering/2-06-fluid-dynamics-spring-2013/syllabus/][syllabus]] (studies the first three chapters
    of Frank White's {{{book-title(Fluid Mechanics)}}}, 7th ed.)
  + 2.25 "Advanced fluid mechanics" [[https://ocw.mit.edu/courses/mechanical-engineering/2-25-advanced-fluid-mechanics-fall-2013/syllabus/][syllabus]]
  + 2.26 "Compressible Fluid Dynamics" [[https://ocw.mit.edu/courses/mechanical-engineering/2-26-compressible-fluid-dynamics-spring-2004/syllabus/][syllabus]]
  + 2.29 "Numerical Fluid Mechanics" [[https://ocw.mit.edu/courses/mechanical-engineering/2-29-numerical-fluid-mechanics-spring-2015/syllabus/][syllabus]]
  + 12.003 "Atmosphere, Ocean and Climate Dynamics" [[https://ocw.mit.edu/courses/earth-atmospheric-and-planetary-sciences/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/syllabus/][syllabus]]
  + 12.800 "Fluid Dynamics of the Atmosphere and Ocean" [[https://ocw.mit.edu/courses/earth-atmospheric-and-planetary-sciences/12-800-fluid-dynamics-of-the-atmosphere-and-ocean-fall-2004/syllabus/][syllabus]]
  + 13.024 "Numerical Marine Hydrodynamics" [[https://ocw.mit.edu/courses/mechanical-engineering/2-29-numerical-marine-hydrodynamics-13-024-spring-2003/syllabus/][syllabus]]
- Caltech
  + [[https://shepherd.caltech.edu/T5/resources/AE101_Guide.pdf][Fluid Mechanics 101: A Skeleton Guide]] (pdf)
  + Ae/APh/CE/ME 101c: Fluid Mechanics [[https://www.mckeon.caltech.edu/teaching/101/AeAPhCEME101c_Syllabus_2019.pdf][syllabus]]
  + Hermann Schlichting, {{{book-title(Boundary Layer Theory)}}}.
- Georgia Tech
  + ME3340 [[https://lorraine.gatech.edu/sites/default/files/academic-info/syllabus/fa20/2_me3340_fluids_zhang_brief_syllabus.pdf][Syllabus]]
    + Munson, Young, and Okiishi’s {{{book-title(Fundamentals of Fluid Mechanics)}}}
  + ME6601 [[http://me.gatech.edu/graduate/courses/me6601][syllabus]] Introduction to Fluid Mechanics
    + Ronald Panton, {{{book-title(Incompressible Flow)}}}, Panton; 2nd Edition, John Wiley; 1995.
    + G. M. Homsy, et al, {{{book-title(Multi-Media Fluid Mechanics)}}} (w/CD), Cambridge University Press, 2000.
  + ME7751 [[http://me.gatech.edu/graduate/courses/me7751][Syllabus]] Computational Fluid Mechanics
    + Pieter Wesseling,
      {{{book-title(Principles of Computational Fluid Dynamics)}}};
      Springer-Verlag, 2000.
    + Joel H. Ferziger and Milovan Peric,
      {{{book-title(Computational Methods of Fluid Dynamics)}}},
      3rd Edition, Springer-Verlag, 2001
    + C. Hirsch,
      {{{book-title(Numerical Computation of Internal and External Flows)}}},
      Vol. 1 and 2, John Wiley & Sons, Ltd., 1988.
    + G. F. Carey and Oden, J. T.,
      {{{book-title(Finite Elements: Fluid Mechanics)}}},
      Vol. VI, Prentice-Hall, 1986.
    + C. Canuto, M. Y. Hussaini, A. Quarteroni, and T. A. Zang,
      {{{book-title(Spectral Methods in Fluid Mechanics)}}},
      Springer-Verlag, 1988.
