docs/physics/fluid-mechanics/annotated-bibliography.html
<div id="outline-container-h-0697d22a-8246-4e68-a12f-cb3a5a502eb6" class="outline-2">
<h2 id="h-0697d22a-8246-4e68-a12f-cb3a5a502eb6"><span class="section-number-2">7.</span> Syllabi</h2>
<div class="outline-text-2" id="text-h-0697d22a-8246-4e68-a12f-cb3a5a502eb6">
<p>
Whenever learning a subject, it's wise to examine what the top
universities are doing when teaching the subject.
</p>

<ul class="org-ul">
<li>MIT
<ul class="org-ul">
<li>1.63 "Advanced Fluid Dynamics of the Environment" <a href="https://ocw.mit.edu/courses/civil-and-environmental-engineering/1-63-advanced-fluid-dynamics-of-the-environment-fall-2002/syllabus/">syllabus</a></li>
<li>2.06 "Fluid Dynamics" <a href="https://ocw.mit.edu/courses/mechanical-engineering/2-06-fluid-dynamics-spring-2013/syllabus/">syllabus</a> (studies the first three chapters
of Frank White's <cite class="book-title">Fluid Mechanics</cite>, 7th ed.)</li>
<li>2.25 "Advanced fluid mechanics" <a href="https://ocw.mit.edu/courses/mechanical-engineering/2-25-advanced-fluid-mechanics-fall-2013/syllabus/">syllabus</a></li>
<li>2.26 "Compressible Fluid Dynamics" <a href="https://ocw.mit.edu/courses/mechanical-engineering/2-26-compressible-fluid-dynamics-spring-2004/syllabus/">syllabus</a></li>
<li>2.29 "Numerical Fluid Mechanics" <a href="https://ocw.mit.edu/courses/mechanical-engineering/2-29-numerical-fluid-mechanics-spring-2015/syllabus/">syllabus</a></li>
<li>12.003 "Atmosphere, Ocean and Climate Dynamics" <a href="https://ocw.mit.edu/courses/earth-atmospheric-and-planetary-sciences/12-003-atmosphere-ocean-and-climate-dynamics-fall-2008/syllabus/">syllabus</a></li>
<li>12.800 "Fluid Dynamics of the Atmosphere and Ocean" <a href="https://ocw.mit.edu/courses/earth-atmospheric-and-planetary-sciences/12-800-fluid-dynamics-of-the-atmosphere-and-ocean-fall-2004/syllabus/">syllabus</a></li>
<li>13.024 "Numerical Marine Hydrodynamics" <a href="https://ocw.mit.edu/courses/mechanical-engineering/2-29-numerical-marine-hydrodynamics-13-024-spring-2003/syllabus/">syllabus</a></li>
</ul></li>
<li>Caltech
<ul class="org-ul">
<li><a href="https://shepherd.caltech.edu/T5/resources/AE101_Guide.pdf">Fluid Mechanics 101: A Skeleton Guide</a> (pdf)</li>
<li>Ae/APh/CE/ME 101c: Fluid Mechanics <a href="https://www.mckeon.caltech.edu/teaching/101/AeAPhCEME101c_Syllabus_2019.pdf">syllabus</a></li>
<li>Hermann Schlichting, <cite class="book-title">Boundary Layer Theory</cite>.</li>
</ul></li>
<li>Georgia Tech
<ul class="org-ul">
<li>ME3340 <a href="https://lorraine.gatech.edu/sites/default/files/academic-info/syllabus/fa20/2_me3340_fluids_zhang_brief_syllabus.pdf">Syllabus</a>
<ul class="org-ul">
<li>Munson, Young, and Okiishi’s <cite class="book-title">Fundamentals of Fluid Mechanics</cite></li>
</ul></li>
<li>ME6601 <a href="http://me.gatech.edu/graduate/courses/me6601">syllabus</a> Introduction to Fluid Mechanics
<ul class="org-ul">
<li>Ronald Panton, <cite class="book-title">Incompressible Flow</cite>, Panton; 2nd Edition, John Wiley; 1995.</li>
<li>G. M. Homsy, et al, <cite class="book-title">Multi-Media Fluid Mechanics</cite> (w/CD), Cambridge University Press, 2000.</li>
</ul></li>
<li>ME7751 <a href="http://me.gatech.edu/graduate/courses/me7751">Syllabus</a> Computational Fluid Mechanics
<ul class="org-ul">
<li>Pieter Wesseling,
<cite class="book-title">Principles of Computational Fluid Dynamics</cite>;
Springer-Verlag, 2000.</li>
<li>Joel H. Ferziger and Milovan Peric,
<cite class="book-title">Computational Methods of Fluid Dynamics</cite>,
3rd Edition, Springer-Verlag, 2001</li>
<li>C. Hirsch,
<cite class="book-title">Numerical Computation of Internal and External Flows</cite>,
Vol. 1 and 2, John Wiley &amp; Sons, Ltd., 1988.</li>
<li>G. F. Carey and Oden, J. T.,
<cite class="book-title">Finite Elements: Fluid Mechanics</cite>,
Vol. VI, Prentice-Hall, 1986.</li>
<li>C. Canuto, M. Y. Hussaini, A. Quarteroni, and T. A. Zang,
<cite class="book-title">Spectral Methods in Fluid Mechanics</cite>,
Springer-Verlag, 1988.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Fri, 8 Apr 2022 11:22:46 -0700
</div>
</body>
</html>
